{
  "version": "0.1.0",
  "description": "Belirli belirti setlerinde sorulacak kısa acil kontrol soruları.",
  "questions": [
    {"id": "chest_pain_redflags", "when_canonical_any": ["göğüs ağrısı", "göğüste baskı"], "question_tr": "Şu an nefes darlığı, soğuk terleme veya ağrının sol kola/çeneye yayılması var mı?", "question_en": "Do you currently have shortness of breath, cold sweats, or pain spreading to your left arm or jaw?", "answer_type": "yes_no", "if_yes_escalate": "ER_NOW", "reason_tr": "Kalp krizi belirtisi olabileceği için acil değerlendirme önerilir.", "reason_en": "Emergency evaluation recommended due to possible heart attack signs."},
    {"id": "headache_redflags", "when_canonical_any": ["baş ağrısı"], "question_tr": "Baş ağrısı ani ve çok şiddetli mi? Kusma veya ışığa hassasiyet eşlik ediyor mu?", "question_en": "Is the headache sudden and very severe? Any vomiting or sensitivity to light?", "answer_type": "yes_no", "if_yes_escalate": "ER_NOW", "reason_tr": "Beyin kanaması vb. acil durum ihtimali nedeniyle hemen değerlendirme önerilir.", "reason_en": "Immediate evaluation recommended due to possible brain hemorrhage or emergency."},
    {"id": "abdominal_pain_redflags", "when_canonical_any": ["karın ağrısı"], "question_tr": "Ateşiniz var mı veya kusma/kanlı/siyah dışkı gibi bir belirti eşlik ediyor mu?", "question_en": "Do you have fever or symptoms like vomiting or bloody/black stools?", "answer_type": "yes_no", "if_yes_escalate": "SAME_DAY", "reason_tr": "Enfeksiyon veya kanama ihtimali nedeniyle bugün değerlendirme önerilir.", "reason_en": "Evaluation today recommended due to possible infection or bleeding."},
    {"id": "cough_redflags", "when_canonical_any": ["öksürük", "balgam"], "question_tr": "Öksürükle kan veya pas rengi balgam geliyor mu? Nefes darlığınız belirgin mi?", "question_en": "Are you coughing blood or rust-colored phlegm? Is your shortness of breath significant?", "answer_type": "yes_no", "if_yes_escalate": "SAME_DAY", "reason_tr": "Akciğer enfeksiyonu veya kanama ihtimali nedeniyle değerlendirme önerilir.", "reason_en": "Evaluation recommended due to possible lung infection or bleeding."}
  ]
}
